/*! 
    \mainpage notitle
    \section intro_sec Описание
    Реализация программы для просмотра 3D моделей в каркасном виде (3D Viewer). 
    Модели загружаются из файлов формата .obj, чтобы просматривать их на экране с возможностью вращения, масштабирования и перемещения.
    Реализована поддержка списка вершин и поверхностей. 
    Программа корректно обрабатыватывает и позволяет пользователю просматривать модели с деталями до 1 000 000 вершин без зависания.
    Настройки сохраняются между перезапусками программы.
    Предоставены следующие возможности:

    - Загрузка каркасной модели из файла формата obj (поддержка только списка вершин и поверхностей).
    - Перемещение модели на заданное расстояние относительно осей X, Y, Z.
    - Поворачивание модели на заданный угол относительно своих осей X, Y, Z
    - Масштабировать модель на заданное значение.
    - Сохранение полученных ("отрендеренных") изображений в файл в форматах bmp и jpeg
    - Запись небольших "скринкастов" - gif-анимация
    
    - выбор файла с моделью и поле для вывода его названия.
    - Зону визуализации каркасной модели.
    - Кнопку/кнопки и поля ввода для перемещения модели.
    - Кнопку/кнопки и поля ввода для поворота модели.
    - Кнопку/кнопки и поля ввода для масштабирования модели.
    - Информацию о загруженной модели - название файла, количество вершин и ребер.
    - Кнопки настройки типа проекции (параллельная и центральная)
    - Кнопки настройки цвета фона
    - Кнопки настройки типа (сплошная, пунктирная), цвета и толщины ребер
    - Кнопки способa отображения (отсутствует, круг, квадрат), цвет и размер вершин
    - Кнопки сохранения изображений в форматах bmp и jpeg
    - Кнопки записи скринкастов - gif-анимации
 */
